InformationRegisters/ФотографииКошек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФотографииКошек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФотографияКошки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФотографииКошек/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Запись.Кошка = Справочники.Кошки.ПустаяСсылка() И НЕ Запись.ИмяФайла = "" Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Кошка", Запись.Кошка);
		Отбор.Вставить("ИмяФайла", Запись.ИмяФайла);
		Фотография = РегистрыСведений.ФотографииКошек.Получить(Отбор).ФотографияКошки;
		
		ЭтаФорма.АдресФотографии = ПоместитьВоВременноеХранилище(Фотография.Получить());
		
	КонецЕсли;
	
КонецПроцедуры
